# MaterialType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingType..::..MaterialType Property
TemperatureRatingType Class See Also
---
Get the material type information which this temperature rating type belongs to.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireMaterialType MaterialType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaterialType As WireMaterialType
	Get
```

Visual C++
---
```text
public:
property WireMaterialType^ MaterialType {
	WireMaterialType^ get ();
}
```

# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace